Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/dsu.h
/*
 * Component description for DSU
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-28T20:38:26Z */
#ifndef _PIC32CZCA90_DSU_COMPONENT_H_
#define _PIC32CZCA90_DSU_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DSU                                          */
/* ************************************************************************** */

/* -------- DSU_CTRL : (DSU Offset: 0x00) ( /W 32) Control -------- */
#define DSU_CTRL_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_CTRL) Control  Reset Value */

#define DSU_CTRL_SWRST_Pos                    _UINT32_(0)                                          /* (DSU_CTRL) Software Reset Position */
#define DSU_CTRL_SWRST_Msk                    (_UINT32_(0x1) << DSU_CTRL_SWRST_Pos)                /* (DSU_CTRL) Software Reset Mask */
#define DSU_CTRL_SWRST(value)                 (DSU_CTRL_SWRST_Msk & (_UINT32_(value) << DSU_CTRL_SWRST_Pos)) /* Assigment of value for SWRST in the DSU_CTRL register */
#define DSU_CTRL_CMD_Pos                      _UINT32_(16)                                         /* (DSU_CTRL) Command Register Position */
#define DSU_CTRL_CMD_Msk                      (_UINT32_(0xFFFF) << DSU_CTRL_CMD_Pos)               /* (DSU_CTRL) Command Register Mask */
#define DSU_CTRL_CMD(value)                   (DSU_CTRL_CMD_Msk & (_UINT32_(value) << DSU_CTRL_CMD_Pos)) /* Assigment of value for CMD in the DSU_CTRL register */
#define   DSU_CTRL_CMD_NOOP_Val               _UINT32_(0x0)                                        /* (DSU_CTRL) No operation  */
#define   DSU_CTRL_CMD_CRC32_Val              _UINT32_(0xA500)                                     /* (DSU_CTRL) 32-bit Cyclic Redundancy Code  */
#define   DSU_CTRL_CMD_MBIST_Val              _UINT32_(0xA501)                                     /* (DSU_CTRL) Global Memory built-in self-test  */
#define DSU_CTRL_CMD_NOOP                     (DSU_CTRL_CMD_NOOP_Val << DSU_CTRL_CMD_Pos)          /* (DSU_CTRL) No operation Position  */
#define DSU_CTRL_CMD_CRC32                    (DSU_CTRL_CMD_CRC32_Val << DSU_CTRL_CMD_Pos)         /* (DSU_CTRL) 32-bit Cyclic Redundancy Code Position  */
#define DSU_CTRL_CMD_MBIST                    (DSU_CTRL_CMD_MBIST_Val << DSU_CTRL_CMD_Pos)         /* (DSU_CTRL) Global Memory built-in self-test Position  */
#define DSU_CTRL_Msk                          _UINT32_(0xFFFF0001)                                 /* (DSU_CTRL) Register Mask  */


/* -------- DSU_ADDR : (DSU Offset: 0x04) (R/W 32) Address -------- */
#define DSU_ADDR_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_ADDR) Address  Reset Value */

#define DSU_ADDR_ADDR_Pos                     _UINT32_(2)                                          /* (DSU_ADDR) Address Position */
#define DSU_ADDR_ADDR_Msk                     (_UINT32_(0x3FFFFFFF) << DSU_ADDR_ADDR_Pos)          /* (DSU_ADDR) Address Mask */
#define DSU_ADDR_ADDR(value)                  (DSU_ADDR_ADDR_Msk & (_UINT32_(value) << DSU_ADDR_ADDR_Pos)) /* Assigment of value for ADDR in the DSU_ADDR register */
#define DSU_ADDR_Msk                          _UINT32_(0xFFFFFFFC)                                 /* (DSU_ADDR) Register Mask  */

/* MBIST mode */
#define DSU_ADDR_MBIST_AMOD_Pos               _UINT32_(0)                                          /* (DSU_ADDR) Access Mode Position */
#define DSU_ADDR_MBIST_AMOD_Msk               (_UINT32_(0x3) << DSU_ADDR_MBIST_AMOD_Pos)           /* (DSU_ADDR) Access Mode Mask */
#define DSU_ADDR_MBIST_AMOD(value)            (DSU_ADDR_MBIST_AMOD_Msk & (_UINT32_(value) << DSU_ADDR_MBIST_AMOD_Pos))
#define   DSU_ADDR_MBIST_AMOD_EXIT_ON_ERROR_Val _UINT32_(0x0)                                        /* (DSU_ADDR) STATUSA.FAIL rises upon first error and algorithm stops (STATUSA.DONE rises).  */
#define   DSU_ADDR_MBIST_AMOD_PAUSE_ON_ERROR_Val _UINT32_(0x1)                                        /* (DSU_ADDR) STATUSA.FAIL rises when an error is detected and algorith stops until STATUSA.FAIL is cleared. Once cleared, the algorithm is resumed going to next test step.  */
#define DSU_ADDR_MBIST_AMOD_EXIT_ON_ERROR     (DSU_ADDR_MBIST_AMOD_EXIT_ON_ERROR_Val << DSU_ADDR_MBIST_AMOD_Pos) /* (DSU_ADDR) STATUSA.FAIL rises upon first error and algorithm stops (STATUSA.DONE rises). Position  */
#define DSU_ADDR_MBIST_AMOD_PAUSE_ON_ERROR    (DSU_ADDR_MBIST_AMOD_PAUSE_ON_ERROR_Val << DSU_ADDR_MBIST_AMOD_Pos) /* (DSU_ADDR) STATUSA.FAIL rises when an error is detected and algorith stops until STATUSA.FAIL is cleared. Once cleared, the algorithm is resumed going to next test step. Position  */
#define DSU_ADDR_MBIST_Msk                    _UINT32_(0x00000003)                                  /* (DSU_ADDR_MBIST) Register Mask  */


/* -------- DSU_LENGTH : (DSU Offset: 0x08) (R/W 32) Length -------- */
#define DSU_LENGTH_RESETVALUE                 _UINT32_(0x00)                                       /*  (DSU_LENGTH) Length  Reset Value */

#define DSU_LENGTH_LENGTH_Pos                 _UINT32_(2)                                          /* (DSU_LENGTH) Length Position */
#define DSU_LENGTH_LENGTH_Msk                 (_UINT32_(0x3FFFFFFF) << DSU_LENGTH_LENGTH_Pos)      /* (DSU_LENGTH) Length Mask */
#define DSU_LENGTH_LENGTH(value)              (DSU_LENGTH_LENGTH_Msk & (_UINT32_(value) << DSU_LENGTH_LENGTH_Pos)) /* Assigment of value for LENGTH in the DSU_LENGTH register */
#define DSU_LENGTH_Msk                        _UINT32_(0xFFFFFFFC)                                 /* (DSU_LENGTH) Register Mask  */


/* -------- DSU_DATA : (DSU Offset: 0x0C) (R/W 32) Data -------- */
#define DSU_DATA_RESETVALUE                   _UINT32_(0x00)                                       /*  (DSU_DATA) Data  Reset Value */

#define DSU_DATA_DATA_Pos                     _UINT32_(0)                                          /* (DSU_DATA) Data Position */
#define DSU_DATA_DATA_Msk                     (_UINT32_(0xFFFFFFFF) << DSU_DATA_DATA_Pos)          /* (DSU_DATA) Data Mask */
#define DSU_DATA_DATA(value)                  (DSU_DATA_DATA_Msk & (_UINT32_(value) << DSU_DATA_DATA_Pos)) /* Assigment of value for DATA in the DSU_DATA register */
#define DSU_DATA_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (DSU_DATA) Register Mask  */

/* MBIST mode */
#define DSU_DATA_MBIST_STATE_Pos              _UINT32_(0)                                          /* (DSU_DATA) MBIST state Position */
#define DSU_DATA_MBIST_STATE_Msk              (_UINT32_(0x1F) << DSU_DATA_MBIST_STATE_Pos)         /* (DSU_DATA) MBIST state Mask */
#define DSU_DATA_MBIST_STATE(value)           (DSU_DATA_MBIST_STATE_Msk & (_UINT32_(value) << DSU_DATA_MBIST_STATE_Pos))
#define   DSU_DATA_MBIST_STATE_SET1_Val       _UINT32_(0x9)                                        /* (DSU_DATA) SET1 Phase: read '0' write '1'  */
#define   DSU_DATA_MBIST_STATE_SET2_Val       _UINT32_(0xA)                                        /* (DSU_DATA) SET2 Phase: read '1' write '0'  */
#define   DSU_DATA_MBIST_STATE_SET2B_Val      _UINT32_(0xB)                                        /* (DSU_DATA) SET2B Phase: read '0' write '1'  */
#define   DSU_DATA_MBIST_STATE_CLEAR1_Val     _UINT32_(0xC)                                        /* (DSU_DATA) CLEAR1 Phase: read '1' write '0'  */
#define   DSU_DATA_MBIST_STATE_CLEAR2_Val     _UINT32_(0xD)                                        /* (DSU_DATA) CLEAR2 Phase: read '0' write '1'  */
#define   DSU_DATA_MBIST_STATE_CLEAR2B_Val    _UINT32_(0xE)                                        /* (DSU_DATA) CLEAR2B Phase: read '1' write '0'  */
#define   DSU_DATA_MBIST_STATE_READ_Val       _UINT32_(0xF)                                        /* (DSU_DATA) READ Phase: check memory is cleared  */
#define DSU_DATA_MBIST_STATE_SET1             (DSU_DATA_MBIST_STATE_SET1_Val << DSU_DATA_MBIST_STATE_Pos) /* (DSU_DATA) SET1 Phase: read '0' write '1' Position  */
#define DSU_DATA_MBIST_STATE_SET2             (DSU_DATA_MBIST_STATE_SET2_Val << DSU_DATA_MBIST_STATE_Pos) /* (DSU_DATA) SET2 Phase: read '1' write '0' Position  */
#define DSU_DATA_MBIST_STATE_SET2B            (DSU_DATA_MBIST_STATE_SET2B_Val << DSU_DATA_MBIST_STATE_Pos) /* (DSU_DATA) SET2B Phase: read '0' write '1' Position  */
#define DSU_DATA_MBIST_STATE_CLEAR1           (DSU_DATA_MBIST_STATE_CLEAR1_Val << DSU_DATA_MBIST_STATE_Pos) /* (DSU_DATA) CLEAR1 Phase: read '1' write '0' Position  */
#define DSU_DATA_MBIST_STATE_CLEAR2           (DSU_DATA_MBIST_STATE_CLEAR2_Val << DSU_DATA_MBIST_STATE_Pos) /* (DSU_DATA) CLEAR2 Phase: read '0' write '1' Position  */
#define DSU_DATA_MBIST_STATE_CLEAR2B          (DSU_DATA_MBIST_STATE_CLEAR2B_Val << DSU_DATA_MBIST_STATE_Pos) /* (DSU_DATA) CLEAR2B Phase: read '1' write '0' Position  */
#define DSU_DATA_MBIST_STATE_READ             (DSU_DATA_MBIST_STATE_READ_Val << DSU_DATA_MBIST_STATE_Pos) /* (DSU_DATA) READ Phase: check memory is cleared Position  */
#define DSU_DATA_MBIST_INDEX_Pos              _UINT32_(8)                                          /* (DSU_DATA) MBIST bit Index Position */
#define DSU_DATA_MBIST_INDEX_Msk              (_UINT32_(0x1F) << DSU_DATA_MBIST_INDEX_Pos)         /* (DSU_DATA) MBIST bit Index Mask */
#define DSU_DATA_MBIST_INDEX(value)           (DSU_DATA_MBIST_INDEX_Msk & (_UINT32_(value) << DSU_DATA_MBIST_INDEX_Pos))
#define DSU_DATA_MBIST_Msk                    _UINT32_(0x00001F1F)                                  /* (DSU_DATA_MBIST) Register Mask  */


/* -------- DSU_CFG : (DSU Offset: 0x10) (R/W 32) Configuration -------- */
#define DSU_CFG_RESETVALUE                    _UINT32_(0x00)                                       /*  (DSU_CFG) Configuration  Reset Value */

